---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.MechanicalEquipmentSetBeingDeleted
source: html/2f92b4ae-afdc-6342-7a6f-96329238b1f4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.MechanicalEquipmentSetBeingDeleted Property

The mechanical equipment set was deleted because it no longer contained any members.

## Syntax (C#)
```csharp
public static FailureDefinitionId MechanicalEquipmentSetBeingDeleted { get; }
```